docs/devops/2017/03/28/devops-tech-interview-question.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-28 Thu 02:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The question from a DevOps interview</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" type="text/css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/about.html">about</a>
</div>
<div id="content">
<h1 class="title">The question from a DevOps interview</h1>
<p>
The question was to write a function, which returns Nth element from sequence <code>abacabadabacaba....</code>
</p>

<p>
I'm curious why they want devops engineer who knows fractals, but <a href="http://www.abacaba.org/abacaba-article.pdf">here</a> is the link explaining everything about this sequence.
</p>

<p>
Well, the alghorithm is straighforward enough, imagine N as a binary where each digit represents a character, we will read them starting from right to left. The first digit is 'b', second - 'c' and so on. 'a' is a letter by default.
</p>

<div class="org-src-container">
<pre class="src src-quote">jhgfedcba
00000000 a
00000001 b
00000010 a
00000011 c
00000100 a
00000101 b
00000110 a
00000111 d
00001000 a
00001001 b
00001010 a
00001011 c
00001100 a
00001101 b
00001110 a
00001111 e
</pre>
</div>

<p>
We remember that we started with 'a' letter and continue moving from left until we reach 0 digit. If current digit is 1 then we replace the char we remembered earlier according to chars in first line.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">stdio.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-preprocessor">#define</span> <span class="org-variable-name">ABA_LENGTH</span> 400

<span class="org-type">char</span> <span class="org-function-name">aba</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">char</span> <span class="org-variable-name">last</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">(</span>0 == <span class="org-rainbow-delimiters-depth-3">(</span>n &amp; 0b1<span class="org-rainbow-delimiters-depth-3">)</span> || 0 == n<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-keyword">return</span> last;
  <span class="org-keyword">return</span> aba<span class="org-rainbow-delimiters-depth-2">(</span>n &gt;&gt; 1, ++last<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span> **<span class="org-variable-name">argv</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>

  <span class="org-keyword">for</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; ABA_LENGTH; i++<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    printf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"%c"</span>, aba<span class="org-rainbow-delimiters-depth-4">(</span>i, <span class="org-string">'a'</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>

  <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
This way we get a first half of anagram solved. The other part should be easy.
</p>
</div>
<div id="postamble" class="status">
2020
</div>
</body>
</html>
